Revit 2026 API

# IIFCImporterServer Interface

---

Interface for external servers implementing IFC import.

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public interface IIFCImporterServer : IExternalServer
```
```vb
Public Interface IIFCImporterServer
	Inherits IExternalServer
```
```cpp
public interface class IIFCImporterServer : IExternalServer
```
```fsharp
type IIFCImporterServer =
    interface
        interface IExternalServer
    end
```

The IIFCImporterServer type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetDescription | Implement this method to return a description of the server. (Inherited from IExternalServer) |
|  | GetName | Implement this method to return the name of the server. (Inherited from IExternalServer) |
|  | GetServerId | Implement this method to return the id of the server. (Inherited from IExternalServer) |
|  | GetServiceId | Implement this method to return the id of the service. (Inherited from IExternalServer) |
|  | GetVendorId | Implement this method to return the id of the vendor of the server. (Inherited from IExternalServer) |
|  | ImportIFC | The method that Revit will invoke to perform an import from IFC. |

#### Reference

Autodesk.Revit.DB.IFC Namespace